In [1]:
import pandas as pd
import numpy as np

In [2]:
from numpy.random import randn as rn

In [3]:
#every time data changes in this way
matrix_data = rn(5,4)
matrix_data

array([[ 0.36440291,  0.1858433 , -1.22437994, -1.55478894],
       [ 1.87095118, -1.17156863, -0.45309692,  0.93598729],
       [ 0.06626633,  0.5084281 , -0.11171169,  0.72123075],
       [-0.07838478,  1.60143135, -0.1928558 , -0.89738676],
       [ 0.18130251, -1.13423609,  0.61479874, -0.15520568]])

In [4]:
#now the data will not change
np.random.seed(101)
matrix_data = rn(5,4)
matrix_data

array([[ 2.70684984,  0.62813271,  0.90796945,  0.50382575],
       [ 0.65111795, -0.31931804, -0.84807698,  0.60596535],
       [-2.01816824,  0.74012206,  0.52881349, -0.58900053],
       [ 0.18869531, -0.75887206, -0.93323722,  0.95505651],
       [ 0.19079432,  1.97875732,  2.60596728,  0.68350889]])

In [5]:
#convert to dataframe
pd.DataFrame(matrix_data)

          0         1         2         3
0  2.706850  0.628133  0.907969  0.503826
1  0.651118 -0.319318 -0.848077  0.605965
2 -2.018168  0.740122  0.528813 -0.589001
3  0.188695 -0.758872 -0.933237  0.955057
4  0.190794  1.978757  2.605967  0.683509

In [6]:
row_level = ['A','B','C','D','D']
column_heading = ['X','Y','Z','P']
df = pd.DataFrame(matrix_data,row_level,column_heading)
df

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [15]:
df[['X','Y']]

          X         Y
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [26]:
df.loc['D']

          X         Y         Z         P
D  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [17]:
type(df.loc['E'])

pandas.core.series.Series

In [27]:
#using named index
df.loc[['A','D']]

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
D  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [30]:
type(df.loc[['A','D'],['X']])

pandas.core.frame.DataFrame

In [22]:
#using default index
df.iloc[[0,1]]

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [32]:
df.loc[['A','D'],['X','Y']]

          X         Y
A  2.706850  0.628133
D  0.188695 -0.758872
D  0.190794  1.978757

In [9]:
df.iloc[[1,2],[1,2]]

          Y         Z
B -0.319318 -0.848077
C  0.740122  0.528813

In [35]:
df.iloc[[0,4],[0,3]]

          X         P
A  2.706850  0.503826
D  0.190794  0.683509

In [37]:
#ideal way
df.iloc[[0,-1],[0,-1]]

          X         P
A  2.706850  0.503826
D  0.190794  0.683509

In [42]:
df.loc['B':'C','Y':'Z']

          Y         Z
B -0.319318 -0.848077
C  0.740122  0.528813

In [46]:
df['new'] = df['X'] + df['Z']

In [47]:
df

          X         Y         Z         P       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
D  0.190794  1.978757  2.605967  0.683509  2.796762

In [48]:
#Drop column not parmanant
df.drop('X',axis=1)

          Y         Z         P       new
A  0.628133  0.907969  0.503826  3.614819
B -0.319318 -0.848077  0.605965 -0.196959
C  0.740122  0.528813 -0.589001 -1.489355
D -0.758872 -0.933237  0.955057 -0.744542
D  1.978757  2.605967  0.683509  2.796762

In [50]:
#Drop Row not parmanant
df.drop('B',axis=0)

          X         Y         Z         P       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
D  0.190794  1.978757  2.605967  0.683509  2.796762

In [51]:
#Drop column parmanant
df.drop('new',axis=1,inplace=True)

In [52]:
df

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [7]:
df

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [10]:
print(df>0)

       X      Y      Z      P
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
D   True   True   True   True

In [11]:
print(df.loc[['A','B']]>0)

      X      Y      Z     P
A  True   True   True  True
B  True  False  False  True

In [12]:
df.loc[['A','B']]>0

      X      Y      Z     P
A  True   True   True  True
B  True  False  False  True

In [13]:
df[df.loc[['A','B']]>0]

          X         Y         Z         P
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN       NaN       NaN       NaN
D       NaN       NaN       NaN       NaN
D       NaN       NaN       NaN       NaN

In [16]:
mat_data = np.matrix('22,66,40;42,70,148;30,62,125;38,68,160;25,62,152')
row = ['A','B','C','D','E']
column_heding = ['Age','Height','Weight']
df = pd.DataFrame(data=mat_data,index=row,columns=column_heding)
df

   Age  Height  Weight
A   22      66      40
B   42      70     148
C   30      62     125
D   38      68     160
E   25      62     152

In [17]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66      40
B   42      70     148
D   38      68     160

In [18]:
df[(df['Height']>65)&(df['Age']>30)&(df['Weight']>125)]

   Age  Height  Weight
B   42      70     148
D   38      68     160

In [22]:
#reset index default
df.reset_index()

  index  Age  Height  Weight
0     A   22      66      40
1     B   42      70     148
2     C   30      62     125
3     D   38      68     160
4     E   25      62     152

In [23]:
#named indexes remove
df.reset_index(drop=True)

   Age  Height  Weight
0   22      66      40
1   42      70     148
2   30      62     125
3   38      68     160
4   25      62     152

In [26]:
#add new column and set new column as indexe
df['occupation'] = "Student Teacher Engineer Doctor Nurse".split()
df.set_index('occupation')

            Age  Height  Weight
occupation
Student      22      66      40
Teacher      42      70     148
Engineer     30      62     125
Doctor       38      68     160
Nurse        25      62     152

In [28]:
#multi index
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [30]:
list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [29]:
print(type(hier_index))

<class 'pandas.core.indexes.multi.MultiIndex'>

In [31]:
df1 = pd.DataFrame(data = np.round(rn(6,3)), index=hier_index, columns=['A','B','C'])
df1

        A    B    C
G1 1  0.0  2.0 -2.0
   2 -1.0 -0.0  0.0
   3  0.0  0.0  1.0
G2 1  0.0  1.0  0.0
   2 -0.0 -1.0 -1.0
   3  0.0 -0.0  2.0

In [32]:
df1.loc['G2']

     A    B    C
1  0.0  1.0  0.0
2 -0.0 -1.0 -1.0
3  0.0 -0.0  2.0

In [33]:
df1.loc['G2'].loc[2]

A   -0.0
B   -1.0
C   -1.0
Name: 2, dtype: float64

In [35]:
df1.loc['G2'].loc[3,['B','C']]

B   -0.0
C    2.0
Name: 3, dtype: float64

In [37]:
l1 = ['A','A','A','B','B','B','C','C','C']
l2 = [1,2,3,1,2,3,1,2,3]
l3 = [1,2,3,4,5,6,7,8,9]
hier_index2 = list(zip(l1,l2,l3))
hier_index2 = pd.MultiIndex.from_tuples(hier_index2)
hier_index2

MultiIndex([('A', 1, 1),
            ('A', 2, 2),
            ('A', 3, 3),
            ('B', 1, 4),
            ('B', 2, 5),
            ('B', 3, 6),
            ('C', 1, 7),
            ('C', 2, 8),
            ('C', 3, 9)],
           )

In [39]:
df2 = pd.DataFrame(data = np.round(rn(9,3)), index=hier_index2, columns=['A','B','C'])
df2

         A    B    C
A 1 1  1.0 -0.0  2.0
  2 2 -1.0 -1.0  0.0
  3 3 -1.0 -1.0  1.0
B 1 4  1.0 -2.0  1.0
  2 5  1.0 -1.0  1.0
  3 6 -1.0 -0.0 -0.0
C 1 7  0.0  0.0  0.0
  2 8 -1.0  2.0  1.0
  3 9 -1.0 -1.0  1.0

In [47]:
df_na = pd.read_excel('C:/Users/Ratnadeep/Desktop/python/Self Based Pandas/NA.xlsx')
df_na

   id   name     sal
0   1    NaN     NaN
1   1  ratna  3000.0
2   1   puja     NaN
3   2   deep   200.0
4   2    NaN  3565.0
5   2   puja     NaN

In [48]:
df_na.dropna()

   id   name     sal
1   1  ratna  3000.0
3   2   deep   200.0

In [49]:
df_na.dropna(axis=1)

   id
0   1
1   1
2   1
3   2
4   2
5   2

In [59]:
#only drop non NA value is more than 1
df_na.dropna(thresh=3)

   id   name     sal
1   1  ratna  3000.0
3   2   deep   200.0

In [57]:
df_na.dropna(axis=1,thresh=4)

   id   name
0   1    NaN
1   1  ratna
2   1   puja
3   2   deep
4   2    NaN
5   2   puja